#+TITLE: Créer et utiliser une base de données
#+PROPERTY: header-args:jupyter-python :session *Py* :results raw drawer :cache no :async yes :exports both :eval no

#+SUBTITLE: Movie Db
#+AUTHOR: Pierre, Thierno, Bastien, Laurent
#+EMAIL: siksous@gmail.com
# #+DATE:
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  fr

# specifying the beamer startup gives access to a number of
# keybindings which make configuring individual slides and components
# of slides easier.  See, for instance, C-c C-b on a frame headline.
#+STARTUP: beamer

#+STARTUP: oddeven

# we tell the exporter to use a specific LaTeX document class, as
# defined in org-latex-classes.  By default, this does not include a
# beamer entry so this needs to be defined in your configuration (see
# the tutorial).
#+LaTeX_CLASS: beamer
# #+LaTeX_CLASS_OPTIONS: [bigger] 

#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+LATEX_HEADER: \usepackage[titles]{tocloft}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[font=scriptsize]{caption} 
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{xcode}

#+LaTeX_CLASS_OPTIONS: [french] 

# #+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \definecolor{UBCblue}{rgb}{0.04706, 0.13725, 0.26667} % UBC Blue (primary)
#+LATEX_HEADER: \usecolortheme[named=UBCblue]{structure}
#+LaTeX_HEADER: \newminted{sqlite}{fontsize=\footnotesize}
# Raise footnotes 
#+LaTeX_HEADER:\addtobeamertemplate{footnote}{}{\vspace{2ex}}

# Beamer supports alternate themes.  Choose your favourite here
#+BEAMER_COLOR_THEME: dolphin
#+BEAMER_FONT_THEME: professionalfonts
#+BEAMER_INNER_THEME: [shadow]rounded
#+BEAMER_OUTER_THEME: infolines

# the beamer exporter expects to be told which level of headlines
# defines the frames.  We use the first level headlines for sections
# and the second (hence H:2) for frames.
#+OPTIONS: ^:nil H:2 toc:1

# the following allow us to selectively choose headlines to export or not
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

* Preamble                                                         :noexport:

#+begin_src emacs-lisp
(setq org-src-fontify-natively t)

(setq org-latex-image-default-width "5cm")
(setq org-image-actual-width 400)
(add-to-list 'org-latex-minted-langs '(sqlite "sqlite3"))
(add-to-list 'org-latex-minted-langs '(sqlite "sql"))
#+end_src

#+RESULTS:
| sqlite         | sql         |
| sqlite         | sqlite3     |
| jupyter-python | python      |
| emacs-lisp     | common-lisp |
| cc             | c++         |
| cperl          | perl        |
| shell-script   | bash        |
| caml           | ocaml       |


** le top 10 des films les plus rentables

#+header: :results orgtable :colnames yes :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT title,gross-budget FROM Movie ORDER BY gross-budget DESC LIMIT 10
#+end_src

#+RESULTS:
| title                                      | gross-budget |
|--------------------------------------------+--------------|
| Avatar                                     |    523505847 |
| Jurassic World                             |    502177271 |
| Titanic                                    |    458672302 |
| Star Wars: Episode IV - A New Hope         |    449935665 |
| E.T. the Extra-Terrestrial                 |    424449459 |
| The Lion King                              |    377783777 |
| Star Wars: Episode I - The Phantom Menace  |    359544677 |
| The Dark Knight                            |    348316061 |
| The Hunger Games                           |    329999255 |
| Deadpool                                   |    305024263 |


** le top 10 des films les moins rentables

#+header: :results orgtable :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT title,gross-budget FROM Movie ORDER BY gross-budget ASC LIMIT 10
#+end_src

#+RESULTS:
| The Host                | -12213298588 |
| Lady Vengeance          |  -4199788333 |
| Fateless                |  -2499804112 |
| Princess Mononoke       |  -2397701809 |
| Steamboy                |  -2127109510 |
| Akira                   |  -1099560838 |
| Godzilla 2000           |   -989962610 |
| Tango                   |   -698312689 |
| Kabhi Alvida Naa Kehna  |   -696724557 |
| Red Cliff               |   -553005191 |


** les réalisateurs qui ont fait le plus de films
:PROPERTIES:
:BEAMER_OPT: shrink=5
:END:

#+header: :results orgtable :exports both
#+header: :dir
#+header: :db movie.db
#+begin_src sqlite 
SELECT
a.name, COUNT(*)
FROM
Artist a
INNER JOIN
(Movie m INNER JOIN appearances p ON m.id = p.movie_id) ON a.id = p.artist_id
WHERE role='director'
GROUP BY a.name
ORDER BY COUNT(*) DESC LIMIT 10;
#+end_src

#+RESULTS:
| Steven Spielberg  | 26 |
| Woody Allen       | 22 |
| Martin Scorsese   | 20 |
| Clint Eastwood    | 20 |
| Spike Lee         | 16 |
| Ridley Scott      | 15 |
| Renny Harlin      | 15 |
| Steven Soderbergh | 14 |
| Oliver Stone      | 14 |
| Ron Howard        | 13 |

** l'acteur qui a joué dans le plus de films

#+header: :results orgtable :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT
a.name, COUNT(*)
FROM
Artist a
INNER JOIN
(Movie m INNER JOIN appearances p ON m.id = p.movie_id) ON a.id = p.artist_id
WHERE role='actor_1' OR role='actor_2' OR role='actor_3'
GROUP BY a.name
ORDER BY COUNT(*) DESC LIMIT 1;
#+end_src

#+RESULTS:
| Robert De Niro | 51 |


** le nombre de films avec "love" dans les mots clés

#+header: :results orgtable :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT COUNT(*) From movie WHERE plot_keywords LIKE '% love,%'
#+end_src

#+RESULTS:
: 156

** le nombre de films français

#+header: :results orgtable :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT COUNT(*) From movie WHERE language = 'French'
#+end_src

#+RESULTS:
: 64


** le réalisateur avec au moins 10 films qui obtient la meilleure moyenne (note imdb)

#+header: :results orgtable :exports both
#+header: :dir .
#+header: :db movie.db
#+begin_src sqlite 
SELECT a.name, AVG(m.imdb_score), COUNT(*)
FROM movie m INNER JOIN appearances p
ON m.id = p.movie_id INNER JOIN artist a
ON p.artist_id = a.id WHERE p.role='director'
GROUP BY a.name HAVING COUNT(m.id) > 9
ORDER BY AVG(m.imdb_score) DESC LIMIT 1
#+end_src

#+RESULTS:
| David Fincher | 7.75 | 10 |


